Revit 2027 API
NumberingSchema.GetNumbers Method
 Returns all numbers currently used in the given numbering sequence
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IntegerRange> GetNumbers(
	string partition
)
Public Function GetNumbers (
	partition As String
) As IList(Of IntegerRange)
public:
IList<IntegerRange^>^ GetNumbers(
	String^ partition
)
member GetNumbers :
        partition : string -> IList<IntegerRange>
Parameters
partition String
 Name of the partition that identifies the sequence. The sequence must exist.
Return Value
IList<IntegerRange>
 A collection of integer ranges
Exceptions
Exception | Condition
ArgumentException |  The sequence partition does not exist in the schema.
ArgumentNullException |  A non-optional argument was null
Remarks
Numbers are returned as a collection of ranges, where each range is a pair of two integer values, Low and High. As long as there is no gap currently in the sequence, there will be only one range.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace